{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem1_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stem1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stem1/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem1/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem1/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem1/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stem1/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stem1/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stem2_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stem2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stem2/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem2/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem2/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem2/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stem2/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stem2/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stem3_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stem3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stem3/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem3/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem3/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stem3/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stem3/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stem3/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_1/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_1/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_1/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_1/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_1/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_1/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_1/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_1/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[24, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_2/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_2/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_2/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_2/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_2/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_2/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_2/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage1_2/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[41, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_tb_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_tb", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_tb/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_tb/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_tb/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_tb/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_tb/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_tb/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "stage1_tb/pool", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "pool_type": "avg", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_1/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_1/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0], [71, 0, 0], [72, 0, 1], [73, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_1/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_1/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_1/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_1/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_1/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_1/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[67, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_2/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_2/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_2/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_2/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_2/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_2/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 1], [98, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_2/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_2/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[84, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_3/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_3/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 1], [107, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_3/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_3/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_3/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_3/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 1], [115, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_3/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_3/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[101, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_4/branch2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_4/branch2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0], [123, 0, 1], [124, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_4/branch2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_4/branch2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_4/branch2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_4/branch2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_4/branch2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "stage2_4/concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[118, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_tb_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_tb", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_tb/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_tb/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_tb/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_tb/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_tb/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_tb/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_tb_ext_pm2", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_tb_ext_pm2/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_tb_ext_pm2/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2a_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_tb_ext_pm2_b2a", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2a/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2a/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2a/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2a/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_tb_ext_pm2_b2a/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 1], [157, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_tb_ext_pm2_b2a/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2b_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_tb_ext_pm2_b2b", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2b/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2b/bn_beta", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2b/bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2b/bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage4_tb_ext_pm2_b2b/bn", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
        "fix_gamma": "False", 
        "momentum": "0.0", 
        "use_global_stats": "False"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "stage4_tb_ext_pm2_b2b/relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2c_weight", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage4_tb_ext_pm2_b2c", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage4_tb_ext_pm2_b2c/bn_gamma", 
      "attrs": {
        "axis": "1", 
        "eps": "0.0010000000475", 
